[NoCoverage] BlockStatement
src/utils/cn.ts:12:45
  * cn('bg-red-500', 'bg-blue-500') // => 'bg-blue-500' (last wins)
  * cn('p-4', { 'text-white': true, 'text-black': false }) // => 'p-4 text-white'
  */
-export function cn(...inputs: ClassValue[]) {
-  return twMerge(clsx(inputs))
-}
+export function cn(...inputs: ClassValue[]) {}
 
