[NoCoverage] ObjectLiteral
src/utils/logger.ts:7:23
  * can capture them on mobile devices.
  */
 
-export const logger = {
-  log: (...args: unknown[]) => console.log(...args),
-  warn: (...args: unknown[]) => console.warn(...args),
-  error: (...args: unknown[]) => console.error(...args),
-}
+export const logger = {}
 

[NoCoverage] ArrowFunction
src/utils/logger.ts:8:8
  */
 
 export const logger = {
-  log: (...args: unknown[]) => console.log(...args),
+  log: () => undefined,
   warn: (...args: unknown[]) => console.warn(...args),
   error: (...args: unknown[]) => console.error(...args),

[NoCoverage] ArrowFunction
src/utils/logger.ts:9:9
 
 export const logger = {
   log: (...args: unknown[]) => console.log(...args),
-  warn: (...args: unknown[]) => console.warn(...args),
+  warn: () => undefined,
   error: (...args: unknown[]) => console.error(...args),
 }

[NoCoverage] ArrowFunction
src/utils/logger.ts:10:10
 export const logger = {
   log: (...args: unknown[]) => console.log(...args),
   warn: (...args: unknown[]) => console.warn(...args),
-  error: (...args: unknown[]) => console.error(...args),
+  error: () => undefined,
 }
 
