[Killed] BlockStatement
src/utils/addressHelper.ts:7:63
  * Generuje pełny adres z obiektu Building
  * Obsługuje zarówno nowe (street, zipCode, city) jak i stare (name) formaty
  */
-export const getFullAddress = (building: Building): string => {
-  // Nowy format: street, zipCode, city
-  if (building.street && building.zipCode && building.city) {
-    return `${building.zipCode} ${building.city}, ul. ${building.street} `
-  }
-
-  // Fallback na stary format (name)
-  if (building.name) {
-    return building.name
-  }
-
-  // Jeśli nic nie jest dostępne
-  return 'Nieznany adres'
-}
+export const getFullAddress = (building: Building): string => {}
 
 /**
killedBy: getFullAddress returns new format when street, zipCode, city are all present
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/utils/addressHelper.ts:9:7
  */
 export const getFullAddress = (building: Building): string => {
   // Nowy format: street, zipCode, city
-  if (building.street && building.zipCode && building.city) {
+  if (true) {
     return `${building.zipCode} ${building.city}, ul. ${building.street} `
   }
killedBy: getFullAddress falls back to legacy name field
statusReason: expected ' , ul.  ' to be 'ul. Stara 5, Gliwice' // Object.is equality

[Killed] ConditionalExpression
src/utils/addressHelper.ts:9:7
  */
 export const getFullAddress = (building: Building): string => {
   // Nowy format: street, zipCode, city
-  if (building.street && building.zipCode && building.city) {
+  if (true && building.city) {
     return `${building.zipCode} ${building.city}, ul. ${building.street} `
   }
killedBy: getFullAddress falls back to name when only city is present
statusReason: expected ' Katowice, ul.  ' to be 'Fallback' // Object.is equality

[Killed] ConditionalExpression
src/utils/addressHelper.ts:14:7
   }
 
   // Fallback na stary format (name)
-  if (building.name) {
+  if (true) {
     return building.name
   }
killedBy: getFullAddress returns "Nieznany adres" when nothing is available
statusReason: expected undefined to be 'Nieznany adres' // Object.is equality

[Killed] BlockStatement
src/utils/addressHelper.ts:14:22
   }
 
   // Fallback na stary format (name)
-  if (building.name) {
-    return building.name
-  }
+  if (building.name) {}
 
   // Jeśli nic nie jest dostępne
killedBy: getFullAddress falls back to legacy name field
statusReason: expected 'Nieznany adres' to be 'ul. Stara 5, Gliwice' // Object.is equality

[Killed] BlockStatement
src/utils/addressHelper.ts:26:73
  * Normalizuje adres do użycia w numerze protokołu
  * Usuwa "ul.", "al.", spacje zamienia na "_", usuwa polskie znaki
  */
-export const normalizeAddressForProtocol = (address: string): string => {
-  return (
-    address
-      .trim()
-      .toUpperCase()
-      // Usuń prefiksy ulic
-      .replace(/^(UL\.|AL\.|OS\.)\s*/i, '')
-      // Usuń polskie znaki
-      .replace(/Ą/g, 'A')
-      .replace(/Ć/g, 'C')
-      .replace(/Ę/g, 'E')
-      .replace(/Ł/g, 'L')
-      .replace(/Ń/g, 'N')
-      .replace(/Ó/g, 'O')
-      .replace(/Ś/g, 'S')
-      .replace(/Ź/g, 'Z')
-      .replace(/Ż/g, 'Z')
-      // Zamień spacje na podkreślenia
-      .replace(/\s+/g, '_')
-      // Usuń przecinki, kropki i inne znaki specjalne
-      .replace(/[,.\-/\\]/g, '')
-  )
-}
+export const normalizeAddressForProtocol = (address: string): string => {}
 
killedBy: normalizeAddressForProtocol converts to uppercase
statusReason: expected undefined to be 'TESTOWA_1' // Object.is equality

[Killed] MethodExpression
src/utils/addressHelper.ts:28:5
  */
 export const normalizeAddressForProtocol = (address: string): string => {
   return (
-    address
-      .trim()
+    address
       .toUpperCase()
       // Usuń prefiksy ulic
killedBy: normalizeAddressForProtocol trims leading and trailing whitespace
statusReason: expected '_TESTOWA_1_' to be 'TESTOWA_1' // Object.is equality

[Killed] MethodExpression
src/utils/addressHelper.ts:28:5
  */
 export const normalizeAddressForProtocol = (address: string): string => {
   return (
-    address
-      .trim()
-      .toUpperCase()
+    address.trim().toLowerCase()
       // Usuń prefiksy ulic
       .replace(/^(UL\.|AL\.|OS\.)\s*/i, '')
killedBy: normalizeAddressForProtocol converts to uppercase
statusReason: expected 'testowa_1' to be 'TESTOWA_1' // Object.is equality

[Killed] Regex
src/utils/addressHelper.ts:32:16
       .trim()
       .toUpperCase()
       // Usuń prefiksy ulic
-      .replace(/^(UL\.|AL\.|OS\.)\s*/i, '')
+      .replace(/^(UL\.|AL\.|OS\.)\s/i, '')
       // Usuń polskie znaki
       .replace(/Ą/g, 'A')
killedBy: normalizeAddressForProtocol removes "ul." prefix without trailing space
statusReason: expected 'ULTESTOWA_1' to be 'TESTOWA_1' // Object.is equality

[Killed] StringLiteral
src/utils/addressHelper.ts:37:22
       .replace(/Ą/g, 'A')
       .replace(/Ć/g, 'C')
       .replace(/Ę/g, 'E')
-      .replace(/Ł/g, 'L')
+      .replace(/Ł/g, "")
       .replace(/Ń/g, 'N')
       .replace(/Ó/g, 'O')
killedBy: normalizeAddressForProtocol replaces spaces with underscores
statusReason: expected 'JANA_PAWA_12' to be 'JANA_PAWLA_12' // Object.is equality

[Killed] Regex
src/utils/addressHelper.ts:44:16
       .replace(/Ź/g, 'Z')
       .replace(/Ż/g, 'Z')
       // Zamień spacje na podkreślenia
-      .replace(/\s+/g, '_')
+      .replace(/\s/g, '_')
       // Usuń przecinki, kropki i inne znaki specjalne
       .replace(/[,.\-/\\]/g, '')
killedBy: normalizeAddressForProtocol collapses multiple spaces into single underscore
statusReason: expected 'JANA___PAWLA__12' to be 'JANA_PAWLA_12' // Object.is equality

[Killed] Regex
src/utils/addressHelper.ts:44:16
       .replace(/Ź/g, 'Z')
       .replace(/Ż/g, 'Z')
       // Zamień spacje na podkreślenia
-      .replace(/\s+/g, '_')
+      .replace(/\S+/g, '_')
       // Usuń przecinki, kropki i inne znaki specjalne
       .replace(/[,.\-/\\]/g, '')
killedBy: normalizeAddressForProtocol converts to uppercase
statusReason: expected '_ _' to be 'TESTOWA_1' // Object.is equality
