[Killed] BlockStatement
src/utils/apartmentUtils.ts:10:78
  * - "10B" -> "11B"
  * - "A1" -> "" (nie potrafi zinkrementować - zwraca pusty string)
  */
-export const incrementApartmentNumber = (apartmentNumber: string): string => {
-  if (!apartmentNumber) return ''
-
-  // Spróbuj dopasować wzorzec: cyfry + opcjonalnie litera na końcu
-  const match = apartmentNumber.match(/^(\d+)([A-Za-z]?)$/)
-
-  if (!match) {
-    // Nie udało się dopasować wzorca - zwróć pusty string
-    return ''
-  }
-
-  const [, digits, letter] = match
-  const incrementedNumber = (parseInt(digits, 10) + 1).toString()
-
-  return incrementedNumber + letter
-}
+export const incrementApartmentNumber = (apartmentNumber: string): string => {}
 
killedBy: incrementApartmentNumber "1" → "2"
statusReason: expected undefined to be '2' // Object.is equality

[Killed] ConditionalExpression
src/utils/apartmentUtils.ts:11:7
  * - "A1" -> "" (nie potrafi zinkrementować - zwraca pusty string)
  */
 export const incrementApartmentNumber = (apartmentNumber: string): string => {
-  if (!apartmentNumber) return ''
+  if (false) return ''
 
   // Spróbuj dopasować wzorzec: cyfry + opcjonalnie litera na końcu
killedBy: incrementApartmentNumber handles undefined-like falsy input
statusReason: Cannot read properties of undefined (reading 'match')

[Killed] ConditionalExpression
src/utils/apartmentUtils.ts:11:7
  * - "A1" -> "" (nie potrafi zinkrementować - zwraca pusty string)
  */
 export const incrementApartmentNumber = (apartmentNumber: string): string => {
-  if (!apartmentNumber) return ''
+  if (true) return ''
 
   // Spróbuj dopasować wzorzec: cyfry + opcjonalnie litera na końcu
killedBy: incrementApartmentNumber "1" → "2"
statusReason: expected '' to be '2' // Object.is equality

[Killed] Regex
src/utils/apartmentUtils.ts:14:39
   if (!apartmentNumber) return ''
 
   // Spróbuj dopasować wzorzec: cyfry + opcjonalnie litera na końcu
-  const match = apartmentNumber.match(/^(\d+)([A-Za-z]?)$/)
+  const match = apartmentNumber.match(/^(\d)([A-Za-z]?)$/)
 
   if (!match) {
killedBy: incrementApartmentNumber "42" → "43"
statusReason: expected '' to be '43' // Object.is equality

[Killed] Regex
src/utils/apartmentUtils.ts:14:39
   if (!apartmentNumber) return ''
 
   // Spróbuj dopasować wzorzec: cyfry + opcjonalnie litera na końcu
-  const match = apartmentNumber.match(/^(\d+)([A-Za-z]?)$/)
+  const match = apartmentNumber.match(/^(\d+)([A-Za-z])$/)
 
   if (!match) {
killedBy: incrementApartmentNumber "1" → "2"
statusReason: expected '' to be '2' // Object.is equality

[Killed] ConditionalExpression
src/utils/apartmentUtils.ts:16:7
   // Spróbuj dopasować wzorzec: cyfry + opcjonalnie litera na końcu
   const match = apartmentNumber.match(/^(\d+)([A-Za-z]?)$/)
 
-  if (!match) {
+  if (true) {
     // Nie udało się dopasować wzorca - zwróć pusty string
     return ''
killedBy: incrementApartmentNumber "1" → "2"
statusReason: expected '' to be '2' // Object.is equality

[Killed] BooleanLiteral
src/utils/apartmentUtils.ts:16:7
   // Spróbuj dopasować wzorzec: cyfry + opcjonalnie litera na końcu
   const match = apartmentNumber.match(/^(\d+)([A-Za-z]?)$/)
 
-  if (!match) {
+  if (match) {
     // Nie udało się dopasować wzorca - zwróć pusty string
     return ''
killedBy: incrementApartmentNumber "1" → "2"
statusReason: expected '' to be '2' // Object.is equality

[Killed] ArithmeticOperator
src/utils/apartmentUtils.ts:22:30
   }
 
   const [, digits, letter] = match
-  const incrementedNumber = (parseInt(digits, 10) + 1).toString()
+  const incrementedNumber = (parseInt(digits, 10) - 1).toString()
 
   return incrementedNumber + letter
killedBy: incrementApartmentNumber "1" → "2"
statusReason: expected '0' to be '2' // Object.is equality

[Killed] ArithmeticOperator
src/utils/apartmentUtils.ts:24:10
   const [, digits, letter] = match
   const incrementedNumber = (parseInt(digits, 10) + 1).toString()
 
-  return incrementedNumber + letter
+  return incrementedNumber - letter
 }
 
killedBy: incrementApartmentNumber "1" → "2"
statusReason: expected 2 to be '2' // Object.is equality
