[Killed] BlockStatement
src/utils/dateUtils.ts:5:73
  * Ensures a value is converted to a Date object
  * Handles Date instances, timestamps, and date strings
  */
-export const ensureDate = (date: Date | string | number | any): Date => {
-  if (date instanceof Date) {
-    return date
-  }
-  return new Date(date)
-}
+export const ensureDate = (date: Date | string | number | any): Date => {}
 
killedBy: ensureDate returns the same Date instance when given a Date
statusReason: expected undefined to be 2026-02-11T23:00:00.000Z // Object.is equality

[Killed] BlockStatement
src/utils/dateUtils.ts:6:29
  * Handles Date instances, timestamps, and date strings
  */
 export const ensureDate = (date: Date | string | number | any): Date => {
-  if (date instanceof Date) {
-    return date
-  }
+  if (date instanceof Date) {}
   return new Date(date)
 }
killedBy: ensureDate returns the same Date instance when given a Date
statusReason: expected 2026-02-11T23:00:00.000Z to be 2026-02-11T23:00:00.000Z // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: 2026-02-11T23:00:00.000Z
Received: serializes to the same string

[Killed] ConditionalExpression
src/utils/dateUtils.ts:6:7
  * Handles Date instances, timestamps, and date strings
  */
 export const ensureDate = (date: Date | string | number | any): Date => {
-  if (date instanceof Date) {
+  if (true) {
     return date
   }
killedBy: ensureDate converts ISO date string to Date
statusReason: expected '2026-02-12T10:30:00Z' to be an instance of Date
