[Killed] BlockStatement
src/utils/idGenerator.ts:4:51
 /**
  * Generate a unique inspection ID
  */
-export const generateInspectionId = (): string => {
-  const timestamp = Date.now()
-  const random = Math.random().toString(36).substring(2, 11)
-  return `insp_${timestamp}_${random}`
-}
+export const generateInspectionId = (): string => {}
 
 /**
killedBy: generateInspectionId starts with "insp_" prefix
statusReason: .toMatch() expects to receive a string, but got undefined

[Survived] MethodExpression
src/utils/idGenerator.ts:6:18
  */
 export const generateInspectionId = (): string => {
   const timestamp = Date.now()
-  const random = Math.random().toString(36).substring(2, 11)
+  const random = Math.random().toString(36)
   return `insp_${timestamp}_${random}`
 }

[Killed] StringLiteral
src/utils/idGenerator.ts:7:10
 export const generateInspectionId = (): string => {
   const timestamp = Date.now()
   const random = Math.random().toString(36).substring(2, 11)
-  return `insp_${timestamp}_${random}`
+  return ``
 }
 
killedBy: generateInspectionId starts with "insp_" prefix
statusReason: expected '' to match /^insp_/

[Killed] BlockStatement
src/utils/idGenerator.ts:13:52
 /**
  * Generate a unique measurement ID
  */
-export const generateMeasurementId = (): string => {
-  const timestamp = Date.now()
-  const random = Math.random()
-  return `m-${timestamp}-${random}`
-}
+export const generateMeasurementId = (): string => {}
 
killedBy: generateMeasurementId starts with "m-" prefix
statusReason: .toMatch() expects to receive a string, but got undefined
