[Killed] BlockStatement
src/utils/measurementCalculations.ts:17:14
 export const calculateZsDop = (
   protectionType: ProtectionType,
   amperage: Amperage
-): number => {
-  return ZS_DOP_TABLE[protectionType][amperage]
-}
+): number => {}
 
 /**
killedBy: calculateZsDop returns NaN for protectionType=10, amperage=4.6
statusReason: expected undefined to be 4.6 // Object.is equality

[Killed] BlockStatement
src/utils/measurementCalculations.ts:28:21
   zsValue: number | null,
   zsDop: number,
   noGrounding?: NoGroundingType
-): 'TAK' | 'NIE' => {
-  if (noGrounding) {
-    return 'NIE'
-  }
-
-  if (zsValue !== null && zsValue <= zsDop) {
-    return 'TAK'
-  }
-
-  return 'NIE'
-}
+): 'TAK' | 'NIE' => {}
 
 /**
killedBy: determineMeasurementResult returns TAK when zsValue < zsDop
statusReason: expected undefined to be 'TAK' // Object.is equality

[Killed] ConditionalExpression
src/utils/measurementCalculations.ts:29:7
   zsDop: number,
   noGrounding?: NoGroundingType
 ): 'TAK' | 'NIE' => {
-  if (noGrounding) {
+  if (true) {
     return 'NIE'
   }
killedBy: determineMeasurementResult returns TAK when zsValue < zsDop
statusReason: expected 'NIE' to be 'TAK' // Object.is equality

[Killed] BlockStatement
src/utils/measurementCalculations.ts:29:20
   zsDop: number,
   noGrounding?: NoGroundingType
 ): 'TAK' | 'NIE' => {
-  if (noGrounding) {
-    return 'NIE'
-  }
+  if (noGrounding) {}
 
   if (zsValue !== null && zsValue <= zsDop) {
killedBy: determineMeasurementResult returns NIE when noGrounding is NO_PIN, even if zsValue <= zsDop
statusReason: expected 'TAK' to be 'NIE' // Object.is equality

[Killed] EqualityOperator
src/utils/measurementCalculations.ts:33:27
     return 'NIE'
   }
 
-  if (zsValue !== null && zsValue <= zsDop) {
+  if (zsValue !== null && zsValue < zsDop) {
     return 'TAK'
   }
killedBy: determineMeasurementResult returns TAK when zsValue === zsDop (boundary)
statusReason: expected 'NIE' to be 'TAK' // Object.is equality

[Killed] ConditionalExpression
src/utils/measurementCalculations.ts:33:7
     return 'NIE'
   }
 
-  if (zsValue !== null && zsValue <= zsDop) {
+  if (true) {
     return 'TAK'
   }
killedBy: determineMeasurementResult returns NIE when zsValue > zsDop
statusReason: expected 'TAK' to be 'NIE' // Object.is equality

[Killed] StringLiteral
src/utils/measurementCalculations.ts:51:28
   amperage: Amperage,
   zsValue: number | null,
   noGrounding?: NoGroundingType,
-  socketType: SocketType = 'Gniazdo 230V'
+  socketType: SocketType = ""
 ): Measurement => {
   const zsDop = calculateZsDop(protectionType, amperage)
killedBy: createMeasurement assembles a complete measurement object with correct result
statusReason: expected { id: 'm-1', pointNumber: 1, …(7) } to deeply equal { id: 'm-1', pointNumber: 1, …(7) }

[Killed] BlockStatement
src/utils/measurementCalculations.ts:52:19
   zsValue: number | null,
   noGrounding?: NoGroundingType,
   socketType: SocketType = 'Gniazdo 230V'
-): Measurement => {
-  const zsDop = calculateZsDop(protectionType, amperage)
-  const result = determineMeasurementResult(zsValue, zsDop, noGrounding)
-
-  const noGroundingField =
-    noGrounding === undefined ? {} : { noGrounding }
-
-  return {
-    id,
-    pointNumber,
-    room,
-    protectionType,
-    amperage,
-    zsValue,
-    zsDop,
-    result,
-    socketType,
-    ...noGroundingField,
-  }
-}
+): Measurement => {}
 
 /**
killedBy: createMeasurement assembles a complete measurement object with correct result
statusReason: expected undefined to deeply equal { id: 'm-1', pointNumber: 1, …(7) }

[Killed] ConditionalExpression
src/utils/measurementCalculations.ts:57:5
   const result = determineMeasurementResult(zsValue, zsDop, noGrounding)
 
   const noGroundingField =
-    noGrounding === undefined ? {} : { noGrounding }
+    true ? {} : { noGrounding }
 
   return {
killedBy: createMeasurement creates failing measurement when noGrounding is set
statusReason: expected undefined to be 'NO_PIN' // Object.is equality

[Killed] ConditionalExpression
src/utils/measurementCalculations.ts:57:5
   const result = determineMeasurementResult(zsValue, zsDop, noGrounding)
 
   const noGroundingField =
-    noGrounding === undefined ? {} : { noGrounding }
+    false ? {} : { noGrounding }
 
   return {
killedBy: createMeasurement omits noGrounding field when undefined
statusReason: expected { id: 'm-1', pointNumber: 1, …(8) } to not have property "noGrounding"

[Killed] ObjectLiteral
src/utils/measurementCalculations.ts:59:10
   const noGroundingField =
     noGrounding === undefined ? {} : { noGrounding }
 
-  return {
-    id,
-    pointNumber,
-    room,
-    protectionType,
-    amperage,
-    zsValue,
-    zsDop,
-    result,
-    socketType,
-    ...noGroundingField,
-  }
+  return {}
 }
 
killedBy: createMeasurement assembles a complete measurement object with correct result
statusReason: expected {} to deeply equal { id: 'm-1', pointNumber: 1, …(7) }

[Killed] BlockStatement
src/utils/measurementCalculations.ts:78:21
  */
 export const renumberMeasurements = (
   measurements: Measurement[]
-): Measurement[] => {
-  return measurements.map((m, idx) => ({
-    ...m,
-    pointNumber: idx + 1,
-  }))
-}
+): Measurement[] => {}
 
 /**
killedBy: renumberMeasurements renumbers sequentially from 1
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/utils/measurementCalculations.ts:79:27
 export const renumberMeasurements = (
   measurements: Measurement[]
 ): Measurement[] => {
-  return measurements.map((m, idx) => ({
-    ...m,
-    pointNumber: idx + 1,
-  }))
+  return measurements.map(() => undefined)
 }
 
killedBy: renumberMeasurements renumbers sequentially from 1
statusReason: Cannot read properties of undefined (reading 'pointNumber')

[Killed] ArithmeticOperator
src/utils/measurementCalculations.ts:81:18
 ): Measurement[] => {
   return measurements.map((m, idx) => ({
     ...m,
-    pointNumber: idx + 1,
+    pointNumber: idx - 1,
   }))
 }
killedBy: renumberMeasurements renumbers sequentially from 1
statusReason: expected [ -1, +0, 1 ] to deeply equal [ 1, 2, 3 ]

[Killed] BlockStatement
src/utils/measurementCalculations.ts:88:75
 /**
  * Count measurements by result type
  */
-export const countMeasurementsByResult = (measurements: Measurement[]) => {
-  return {
-    passed: measurements.filter((m) => m.result === 'TAK').length,
-    failed: measurements.filter((m) => m.result === 'NIE').length,
-  }
-}
+export const countMeasurementsByResult = (measurements: Measurement[]) => {}
 
killedBy: countMeasurementsByResult counts passed and failed correctly
statusReason: expected undefined to deeply equal { passed: 2, failed: 1 }

[Killed] MethodExpression
src/utils/measurementCalculations.ts:90:13
  */
 export const countMeasurementsByResult = (measurements: Measurement[]) => {
   return {
-    passed: measurements.filter((m) => m.result === 'TAK').length,
+    passed: measurements.length,
     failed: measurements.filter((m) => m.result === 'NIE').length,
   }
killedBy: countMeasurementsByResult counts passed and failed correctly
statusReason: expected { passed: 3, failed: 1 } to deeply equal { passed: 2, failed: 1 }

[Killed] ArrowFunction
src/utils/measurementCalculations.ts:90:33
  */
 export const countMeasurementsByResult = (measurements: Measurement[]) => {
   return {
-    passed: measurements.filter((m) => m.result === 'TAK').length,
+    passed: measurements.filter(() => undefined).length,
     failed: measurements.filter((m) => m.result === 'NIE').length,
   }
killedBy: countMeasurementsByResult counts passed and failed correctly
statusReason: expected { passed: +0, failed: 1 } to deeply equal { passed: 2, failed: 1 }

[Killed] MethodExpression
src/utils/measurementCalculations.ts:91:13
 export const countMeasurementsByResult = (measurements: Measurement[]) => {
   return {
     passed: measurements.filter((m) => m.result === 'TAK').length,
-    failed: measurements.filter((m) => m.result === 'NIE').length,
+    failed: measurements.length,
   }
 }
killedBy: countMeasurementsByResult counts passed and failed correctly
statusReason: expected { passed: 2, failed: 3 } to deeply equal { passed: 2, failed: 1 }

[Killed] ConditionalExpression
src/utils/measurementCalculations.ts:91:40
 export const countMeasurementsByResult = (measurements: Measurement[]) => {
   return {
     passed: measurements.filter((m) => m.result === 'TAK').length,
-    failed: measurements.filter((m) => m.result === 'NIE').length,
+    failed: measurements.filter((m) => false).length,
   }
 }
killedBy: countMeasurementsByResult counts passed and failed correctly
statusReason: expected { passed: 2, failed: +0 } to deeply equal { passed: 2, failed: 1 }
