[Killed] BlockStatement
src/utils/protocolGenerator.ts:22:14
   date: Date,
   apartmentNumber: string,
   buildingStreet: string
-): string => {
-  const year = date.getFullYear()
-  const month = String(date.getMonth() + 1).padStart(2, '0')
-  const day = String(date.getDate()).padStart(2, '0')
-
-  // Normalizuj numer mieszkania
-  const normalizedApartment = apartmentNumber
-    .trim()
-    .toUpperCase()
-    .replace(/\s+/g, '_')
-    .replace(/[,.]/g, '')
-
-  // Normalizuj adres ulicy (używa helpera - usuwa "ul.", polskie znaki, etc.)
-  const normalizedStreet = normalizeAddressForProtocol(buildingStreet)
-
-  return `PROT/${year}/${month}/${day}/${normalizedStreet}/${normalizedApartment}`
-}
+): string => {}
 
killedBy: generateProtocolNumber generates correct format for a standard case
statusReason: expected undefined to be 'PROT/2026/02/12/LESNA_5/42' // Object.is equality

[Killed] ArithmeticOperator
src/utils/protocolGenerator.ts:24:24
   buildingStreet: string
 ): string => {
   const year = date.getFullYear()
-  const month = String(date.getMonth() + 1).padStart(2, '0')
+  const month = String(date.getMonth() - 1).padStart(2, '0')
   const day = String(date.getDate()).padStart(2, '0')
 
killedBy: generateProtocolNumber generates correct format for a standard case
statusReason: expected 'PROT/2026/00/12/LESNA_5/42' to be 'PROT/2026/02/12/LESNA_5/42' // Object.is equality

[Killed] StringLiteral
src/utils/protocolGenerator.ts:24:57
   buildingStreet: string
 ): string => {
   const year = date.getFullYear()
-  const month = String(date.getMonth() + 1).padStart(2, '0')
+  const month = String(date.getMonth() + 1).padStart(2, "")
   const day = String(date.getDate()).padStart(2, '0')
 
killedBy: generateProtocolNumber generates correct format for a standard case
statusReason: expected 'PROT/2026/2/12/LESNA_5/42' to be 'PROT/2026/02/12/LESNA_5/42' // Object.is equality

[Killed] MethodExpression
src/utils/protocolGenerator.ts:28:31
   const day = String(date.getDate()).padStart(2, '0')
 
   // Normalizuj numer mieszkania
-  const normalizedApartment = apartmentNumber
-    .trim()
+  const normalizedApartment = apartmentNumber
     .toUpperCase()
     .replace(/\s+/g, '_')
killedBy: generateProtocolNumber trims whitespace from apartment number
statusReason: expected 'PROT/2026/06/15/TESTOWA_1/_42_' to match /\/42$/42$

[Killed] MethodExpression
src/utils/protocolGenerator.ts:28:31
   const day = String(date.getDate()).padStart(2, '0')
 
   // Normalizuj numer mieszkania
-  const normalizedApartment = apartmentNumber
-    .trim()
-    .toUpperCase()
+  const normalizedApartment = apartmentNumber.trim().toLowerCase()
     .replace(/\s+/g, '_')
     .replace(/[,.]/g, '')
killedBy: generateProtocolNumber normalizes apartment number to uppercase
statusReason: expected 'PROT/2026/06/15/TESTOWA_1/12a' to match /\/12A$/12A$

[Killed] Regex
src/utils/protocolGenerator.ts:31:14
   const normalizedApartment = apartmentNumber
     .trim()
     .toUpperCase()
-    .replace(/\s+/g, '_')
+    .replace(/\s/g, '_')
     .replace(/[,.]/g, '')
 
killedBy: generateProtocolNumber collapses multiple spaces in apartment to single underscore
statusReason: expected 'PROT/2026/06/15/TESTOWA_1/LOKAL___3' to match /\/LOKAL_3$/LOKAL_3$

[Killed] Regex
src/utils/protocolGenerator.ts:32:14
     .trim()
     .toUpperCase()
     .replace(/\s+/g, '_')
-    .replace(/[,.]/g, '')
+    .replace(/[^,.]/g, '')
 
   // Normalizuj adres ulicy (używa helpera - usuwa "ul.", polskie znaki, etc.)
killedBy: generateProtocolNumber generates correct format for a standard case
statusReason: expected 'PROT/2026/02/12/LESNA_5/' to be 'PROT/2026/02/12/LESNA_5/42' // Object.is equality

[Killed] StringLiteral
src/utils/protocolGenerator.ts:37:10
   // Normalizuj adres ulicy (używa helpera - usuwa "ul.", polskie znaki, etc.)
   const normalizedStreet = normalizeAddressForProtocol(buildingStreet)
 
-  return `PROT/${year}/${month}/${day}/${normalizedStreet}/${normalizedApartment}`
+  return ``
 }
 
killedBy: generateProtocolNumber generates correct format for a standard case
statusReason: expected '' to be 'PROT/2026/02/12/LESNA_5/42' // Object.is equality
