[Killed] BlockStatement
src/utils/validators.ts:4:55
 /**
  * Validate if a string is not empty
  */
-export const isNotEmpty = (value: string): boolean => {
-  return value.trim().length > 0
-}
+export const isNotEmpty = (value: string): boolean => {}
 
 /**
killedBy: isNotEmpty returns true for non-empty string
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/validators.ts:5:10
  * Validate if a string is not empty
  */
 export const isNotEmpty = (value: string): boolean => {
-  return value.trim().length > 0
+  return false
 }
 
killedBy: isNotEmpty returns true for non-empty string
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/utils/validators.ts:5:10
  * Validate if a string is not empty
  */
 export const isNotEmpty = (value: string): boolean => {
-  return value.trim().length > 0
+  return value.length > 0
 }
 
killedBy: isNotEmpty returns false for whitespace-only string
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/validators.ts:15:44
   address: string,
   apartmentNumber: string,
   technician: string
-): { isValid: boolean; error?: string } => {
-  if (!isNotEmpty(address)) {
-    return { isValid: false, error: 'Adres jest wymagany' }
-  }
-
-  if (!isNotEmpty(apartmentNumber)) {
-    return { isValid: false, error: 'Numer mieszkania jest wymagany' }
-  }
-
-  if (!isNotEmpty(technician)) {
-    return { isValid: false, error: 'Imię technika jest wymagane' }
-  }
-
-  return { isValid: true }
-}
+): { isValid: boolean; error?: string } => {}
 
 /**
killedBy: validateInspectionForm returns valid for all non-empty fields
statusReason: expected undefined to deeply equal { isValid: true }

[Killed] BooleanLiteral
src/utils/validators.ts:16:7
   apartmentNumber: string,
   technician: string
 ): { isValid: boolean; error?: string } => {
-  if (!isNotEmpty(address)) {
+  if (isNotEmpty(address)) {
     return { isValid: false, error: 'Adres jest wymagany' }
   }
killedBy: validateInspectionForm returns valid for all non-empty fields
statusReason: expected { isValid: false, …(1) } to deeply equal { isValid: true }

[Killed] BlockStatement
src/utils/validators.ts:16:29
   apartmentNumber: string,
   technician: string
 ): { isValid: boolean; error?: string } => {
-  if (!isNotEmpty(address)) {
-    return { isValid: false, error: 'Adres jest wymagany' }
-  }
+  if (!isNotEmpty(address)) {}
 
   if (!isNotEmpty(apartmentNumber)) {
killedBy: validateInspectionForm returns error for empty address
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/validators.ts:17:23
   technician: string
 ): { isValid: boolean; error?: string } => {
   if (!isNotEmpty(address)) {
-    return { isValid: false, error: 'Adres jest wymagany' }
+    return { isValid: true, error: 'Adres jest wymagany' }
   }
 
killedBy: validateInspectionForm returns error for empty address
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/utils/validators.ts:17:12
   technician: string
 ): { isValid: boolean; error?: string } => {
   if (!isNotEmpty(address)) {
-    return { isValid: false, error: 'Adres jest wymagany' }
+    return {}
   }
 
killedBy: validateInspectionForm returns error for empty address
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/validators.ts:20:7
     return { isValid: false, error: 'Adres jest wymagany' }
   }
 
-  if (!isNotEmpty(apartmentNumber)) {
+  if (false) {
     return { isValid: false, error: 'Numer mieszkania jest wymagany' }
   }
killedBy: validateInspectionForm returns error for empty apartment number
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/validators.ts:20:37
     return { isValid: false, error: 'Adres jest wymagany' }
   }
 
-  if (!isNotEmpty(apartmentNumber)) {
-    return { isValid: false, error: 'Numer mieszkania jest wymagany' }
-  }
+  if (!isNotEmpty(apartmentNumber)) {}
 
   if (!isNotEmpty(technician)) {
killedBy: validateInspectionForm returns error for empty apartment number
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/validators.ts:21:23
   }
 
   if (!isNotEmpty(apartmentNumber)) {
-    return { isValid: false, error: 'Numer mieszkania jest wymagany' }
+    return { isValid: true, error: 'Numer mieszkania jest wymagany' }
   }
 
killedBy: validateInspectionForm returns error for empty apartment number
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/utils/validators.ts:21:12
   }
 
   if (!isNotEmpty(apartmentNumber)) {
-    return { isValid: false, error: 'Numer mieszkania jest wymagany' }
+    return {}
   }
 
killedBy: validateInspectionForm returns error for empty apartment number
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/utils/validators.ts:24:32
     return { isValid: false, error: 'Numer mieszkania jest wymagany' }
   }
 
-  if (!isNotEmpty(technician)) {
-    return { isValid: false, error: 'Imię technika jest wymagane' }
-  }
+  if (!isNotEmpty(technician)) {}
 
   return { isValid: true }
killedBy: validateInspectionForm returns error for empty technician name
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/validators.ts:24:7
     return { isValid: false, error: 'Numer mieszkania jest wymagany' }
   }
 
-  if (!isNotEmpty(technician)) {
+  if (true) {
     return { isValid: false, error: 'Imię technika jest wymagane' }
   }
killedBy: validateInspectionForm returns valid for all non-empty fields
statusReason: expected { isValid: false, …(1) } to deeply equal { isValid: true }

[Killed] BooleanLiteral
src/utils/validators.ts:25:23
   }
 
   if (!isNotEmpty(technician)) {
-    return { isValid: false, error: 'Imię technika jest wymagane' }
+    return { isValid: true, error: 'Imię technika jest wymagane' }
   }
 
killedBy: validateInspectionForm returns error for empty technician name
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/validators.ts:28:21
     return { isValid: false, error: 'Imię technika jest wymagane' }
   }
 
-  return { isValid: true }
+  return { isValid: false }
 }
 
killedBy: validateInspectionForm returns valid for all non-empty fields
statusReason: expected { isValid: false } to deeply equal { isValid: true }

[Killed] BlockStatement
src/utils/validators.ts:36:44
  */
 export const validateMeasurementValue = (
   value: string
-): { isValid: boolean; error?: string } => {
-  const zsValue = parseFloat(value)
-
-  if (isNaN(zsValue)) {
-    return { isValid: false, error: 'Wprowadź poprawną wartość liczbową' }
-  }
-
-  if (zsValue <= 0) {
-    return { isValid: false, error: 'Wartość musi być większa od 0' }
-  }
-
-  return { isValid: true }
-}
+): { isValid: boolean; error?: string } => {}
 
killedBy: validateMeasurementValue returns valid for positive number string
statusReason: expected undefined to deeply equal { isValid: true }

[Killed] ConditionalExpression
src/utils/validators.ts:39:7
 ): { isValid: boolean; error?: string } => {
   const zsValue = parseFloat(value)
 
-  if (isNaN(zsValue)) {
+  if (false) {
     return { isValid: false, error: 'Wprowadź poprawną wartość liczbową' }
   }
killedBy: validateMeasurementValue returns error for NaN
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/validators.ts:39:23
 ): { isValid: boolean; error?: string } => {
   const zsValue = parseFloat(value)
 
-  if (isNaN(zsValue)) {
-    return { isValid: false, error: 'Wprowadź poprawną wartość liczbową' }
-  }
+  if (isNaN(zsValue)) {}
 
   if (zsValue <= 0) {
killedBy: validateMeasurementValue returns error for NaN
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/validators.ts:40:23
   const zsValue = parseFloat(value)
 
   if (isNaN(zsValue)) {
-    return { isValid: false, error: 'Wprowadź poprawną wartość liczbową' }
+    return { isValid: true, error: 'Wprowadź poprawną wartość liczbową' }
   }
 
killedBy: validateMeasurementValue returns error for NaN
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/utils/validators.ts:40:37
   const zsValue = parseFloat(value)
 
   if (isNaN(zsValue)) {
-    return { isValid: false, error: 'Wprowadź poprawną wartość liczbową' }
+    return { isValid: false, error: "" }
   }
 
killedBy: validateMeasurementValue returns error for NaN
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/utils/validators.ts:43:21
     return { isValid: false, error: 'Wprowadź poprawną wartość liczbową' }
   }
 
-  if (zsValue <= 0) {
-    return { isValid: false, error: 'Wartość musi być większa od 0' }
-  }
+  if (zsValue <= 0) {}
 
   return { isValid: true }
killedBy: validateMeasurementValue returns error for zero with meaningful message
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utils/validators.ts:43:7
     return { isValid: false, error: 'Wprowadź poprawną wartość liczbową' }
   }
 
-  if (zsValue <= 0) {
+  if (zsValue < 0) {
     return { isValid: false, error: 'Wartość musi być większa od 0' }
   }
killedBy: validateMeasurementValue returns error for zero with meaningful message
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/validators.ts:44:23
   }
 
   if (zsValue <= 0) {
-    return { isValid: false, error: 'Wartość musi być większa od 0' }
+    return { isValid: true, error: 'Wartość musi być większa od 0' }
   }
 
killedBy: validateMeasurementValue returns error for zero with meaningful message
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/utils/validators.ts:44:12
   }
 
   if (zsValue <= 0) {
-    return { isValid: false, error: 'Wartość musi być większa od 0' }
+    return {}
   }
 
killedBy: validateMeasurementValue returns error for zero with meaningful message
statusReason: expected undefined to be false // Object.is equality
