[Killed] ConditionalExpression
src/utils/addressHelper.ts:9:7
  */
 export const getFullAddress = (building: Building): string => {
   // Nowy format: street, zipCode, city
-  if (building.street && building.zipCode && building.city) {
+  if (false) {
     return `${building.zipCode} ${building.city}, ul. ${building.street} `
   }
killedBy: getFullAddress returns new format when street, zipCode, city are all present
statusReason: expected 'Nieznany adres' to contain '40-000'
