[Killed] BooleanLiteral
src/utils/apartmentUtils.ts:11:7
  * - "A1" -> "" (nie potrafi zinkrementować - zwraca pusty string)
  */
 export const incrementApartmentNumber = (apartmentNumber: string): string => {
-  if (!apartmentNumber) return ''
+  if (apartmentNumber) return ''
 
   // Spróbuj dopasować wzorzec: cyfry + opcjonalnie litera na końcu
killedBy: incrementApartmentNumber "1" → "2"
statusReason: expected '' to be '2' // Object.is equality
